
<!DOCTYPE HTML>
<html lang="ja" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Vuex とは何か? · Vuex</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-vuejs/vue.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="getting-started.html" />
    
    
    <link rel="prev" href="installation.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="検索すると入力" />
</div>

            
                <nav role="navigation">
                
<script async type="text/javascript" src="//cdn.carbonads.com/carbon.js?zoneid=1673&serve=C6AILKT&placement=vuejs" id="_carbonads_js"></script>




<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <a target="_blank" href="https://github.com/vuejs/vuex/releases">
            
                    
                    リリースノート
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="installation.html">
            
                <a href="installation.html">
            
                    
                    インストール
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="intro.html">
            
                <a href="intro.html">
            
                    
                    Vuex とは何か?
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="getting-started.html">
            
                <a href="getting-started.html">
            
                    
                    Vuex 入門
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="core-concepts.html">
            
                <a href="core-concepts.html">
            
                    
                    コアコンセプト
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="state.html">
            
                <a href="state.html">
            
                    
                    ステート
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="getters.html">
            
                <a href="getters.html">
            
                    
                    ゲッター
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.3" data-path="mutations.html">
            
                <a href="mutations.html">
            
                    
                    ミューテーション
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.4" data-path="actions.html">
            
                <a href="actions.html">
            
                    
                    アクション
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.5" data-path="modules.html">
            
                <a href="modules.html">
            
                    
                    モジュール
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="structure.html">
            
                <a href="structure.html">
            
                    
                    アプリケーションの構造
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="plugins.html">
            
                <a href="plugins.html">
            
                    
                    プラグイン
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="strict.html">
            
                <a href="strict.html">
            
                    
                    厳格モード
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="forms.html">
            
                <a href="forms.html">
            
                    
                    フォームの扱い
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="testing.html">
            
                <a href="testing.html">
            
                    
                    テスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="hot-reload.html">
            
                <a href="hot-reload.html">
            
                    
                    ホットリローディング
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="api.html">
            
                <a href="api.html">
            
                    
                    API リファレンス
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            GitBookで公開 
        </a>
    </li>
</ul>



                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
  
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Vuex とは何か?</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="vuex-&#x3068;&#x306F;&#x4F55;&#x304B;&#xFF1F;">Vuex &#x3068;&#x306F;&#x4F55;&#x304B;&#xFF1F;</h1>
<p>Vuex &#x306F; Vue.js &#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x305F;&#x3081;&#x306E; <strong>&#x72B6;&#x614B;&#x7BA1;&#x7406;&#x30D1;&#x30BF;&#x30FC;&#x30F3; + &#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;</strong>&#x3067;&#x3059;&#x3002;
&#x3053;&#x308C;&#x306F;&#x4E88;&#x6E2C;&#x53EF;&#x80FD;&#x306A;&#x65B9;&#x6CD5;&#x306B;&#x3088;&#x3063;&#x3066;&#x306E;&#x307F;&#x72B6;&#x614B;&#x306E;&#x5909;&#x7570;&#x3092;&#x884C;&#x3046;&#x3068;&#x3044;&#x3046;&#x30EB;&#x30FC;&#x30EB;&#x3092;&#x4FDD;&#x8A3C;&#x3057;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x5185;&#x306E;&#x5168;&#x3066;&#x306E;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x306E;&#x305F;&#x3081;&#x306E;&#x96C6;&#x4E2D;&#x578B;&#x306E;&#x30B9;&#x30C8;&#x30A2;&#x3068;&#x3057;&#x3066;&#x6A5F;&#x80FD;&#x3057;&#x307E;&#x3059;&#x3002;
&#x307E;&#x305F; Vue &#x516C;&#x5F0F;&#x306E;<a href="https://github.com/vuejs/vue-devtools" target="_blank">&#x958B;&#x767A;&#x30C4;&#x30FC;&#x30EB;&#x62E1;&#x5F35;</a>&#x3068;&#x9023;&#x643A;&#x3057;&#x3001;&#x8A2D;&#x5B9A;&#x306A;&#x3057;&#x3067;&#x30BF;&#x30A4;&#x30E0;&#x30C8;&#x30E9;&#x30D9;&#x30EB;&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x3084;&#x30B9;&#x30C6;&#x30FC;&#x30C8;&#x306E;&#x30B9;&#x30CA;&#x30C3;&#x30D7;&#x30B7;&#x30E7;&#x30C3;&#x30C8;&#x306E;&#x30A8;&#x30AF;&#x30B9;&#x30DD;&#x30FC;&#x30C8;&#x3084;&#x30A4;&#x30F3;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x3088;&#x3046;&#x306A;&#x9AD8;&#x5EA6;&#x306A;&#x6A5F;&#x80FD;&#x3092;&#x63D0;&#x4F9B;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<h3 id="&#x72B6;&#x614B;&#x7BA1;&#x7406;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x3068;&#x306F;&#x306A;&#x3093;&#x3067;&#x3059;&#x304B;&#xFF1F;">&quot;&#x72B6;&#x614B;&#x7BA1;&#x7406;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&quot;&#x3068;&#x306F;&#x306A;&#x3093;&#x3067;&#x3059;&#x304B;&#xFF1F;</h3>
<p>&#x5358;&#x7D14;&#x306A; Vue &#x3067;&#x4F5C;&#x3089;&#x308C;&#x305F;&#x30AB;&#x30A6;&#x30F3;&#x30BF;&#x30FC;&#x30A2;&#x30D7;&#x30EA;&#x3092;&#x307F;&#x3066;&#x307F;&#x307E;&#x3057;&#x3087;&#x3046;:</p>
<pre class="language-"><code class="lang-js"><span class="token keyword">new</span> <span class="token class-name">Vue</span><span class="token punctuation">(</span><span class="token punctuation">{</span>
  <span class="token comment" spellcheck="true">// state</span>
  data <span class="token punctuation">(</span><span class="token punctuation">)</span> <span class="token punctuation">{</span>
    <span class="token keyword">return</span> <span class="token punctuation">{</span>
      count<span class="token punctuation">:</span> <span class="token number">0</span>
    <span class="token punctuation">}</span>
  <span class="token punctuation">}</span><span class="token punctuation">,</span>
  <span class="token comment" spellcheck="true">// view</span>
  template<span class="token punctuation">:</span> <span class="token template-string"><span class="token string">`
    &lt;div&gt;{{ count }}&lt;/div&gt;
  `</span></span><span class="token punctuation">,</span>
  <span class="token comment" spellcheck="true">// actions</span>
  methods<span class="token punctuation">:</span> <span class="token punctuation">{</span>
    increment <span class="token punctuation">(</span><span class="token punctuation">)</span> <span class="token punctuation">{</span>
      <span class="token keyword">this</span><span class="token punctuation">.</span>count<span class="token operator">++</span>
    <span class="token punctuation">}</span>
  <span class="token punctuation">}</span>
<span class="token punctuation">}</span><span class="token punctuation">)</span>
</code></pre>
<p>&#x3053;&#x308C;&#x306F;&#x3044;&#x304F;&#x3064;&#x304B;&#x306E;&#x8981;&#x7D20;&#x3092;&#x30A2;&#x30D7;&#x30EA;&#x81EA;&#x8EAB;&#x306B;&#x542B;&#x3093;&#x3067;&#x3044;&#x307E;&#x3059;:</p>
<ul>
<li><strong>&#x72B6;&#x614B;</strong>&#x3001;&#x3053;&#x308C;&#x306F;&#x79C1;&#x9054;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x3092;&#x52D5;&#x304B;&#x3059;&#x4FE1;&#x983C;&#x3067;&#x304D;&#x308B;&#x60C5;&#x5831;&#x6E90;(the source of truth)&#x3067;&#x3059;&#x3002;</li>
<li><strong>&#x30D3;&#x30E5;&#x30FC;</strong>&#x3001;&#x3053;&#x308C;&#x306F;<strong>&#x72B6;&#x614B;</strong>&#x306E;&#x305F;&#x3060;&#x306E;&#x5BA3;&#x8A00;&#x7684;&#x306A;&#x30DE;&#x30C3;&#x30D4;&#x30F3;&#x30B0;&#x3067;&#x3059;&#x3002;</li>
<li><strong>&#x30A2;&#x30AF;&#x30B7;&#x30E7;&#x30F3;</strong>&#x3001;&#x3053;&#x308C;&#x306F;<strong>&#x30D3;&#x30E5;&#x30FC;</strong>&#x304B;&#x3089;&#x306E;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x5165;&#x529B;&#x306B;&#x53CD;&#x5FDC;&#x3057;&#x3066;&#x3001;&#x72B6;&#x614B;&#x306E;&#x5909;&#x66F4;&#x3092;&#x53EF;&#x80FD;&#x306B;&#x3059;&#x308B;&#x65B9;&#x6CD5;&#x3067;&#x3059;&#x3002;</li>
</ul>
<p>&#x3053;&#x308C;&#x3089;&#x306F;&quot;&#x5358;&#x65B9;&#x5411;&#x30C7;&#x30FC;&#x30BF;&#x30D5;&#x30ED;&#x30FC;&quot;&#x306E;&#x30B3;&#x30F3;&#x30BB;&#x30D7;&#x30C8;&#x306E;&#x6975;&#x3081;&#x3066;&#x30B7;&#x30F3;&#x30D7;&#x30EB;&#x306A;&#x8CAC;&#x52D9;&#x3067;&#x3059;:</p>
<p style="text-align: center; margin: 2em">
  <img style="width:100%;max-width:450px;" src="images/flow.png">
</p>

<p>&#x3057;&#x304B;&#x3057;&#x3001;&#x5358;&#x7D14;&#x3055;&#x306F;&#x3001;<strong>&#x5171;&#x901A;&#x306E;&#x72B6;&#x614B;&#x3092;&#x5171;&#x6709;&#x3059;&#x308B;&#x8907;&#x6570;&#x306E;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x3092;&#x6301;&#x3063;&#x305F;&#x3068;&#x304D;&#x306B;</strong>&#x3001;&#x3059;&#x3050;&#x306B;&#x7834;&#x7DBB;&#x3057;&#x307E;&#x3059;:</p>
<ul>
<li>&#x8907;&#x6570;&#x306E;&#x30D3;&#x30E5;&#x30FC;&#x304C;&#x540C;&#x3058;&#x72B6;&#x614B;&#x306B;&#x4F9D;&#x5B58;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</li>
<li>&#x7570;&#x306A;&#x308B;&#x30D3;&#x30E5;&#x30FC;&#x304B;&#x3089;&#x306E;&#x30A2;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x3001;&#x540C;&#x3058;&#x72B6;&#x614B;&#x3092;&#x5909;&#x66F4;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</li>
</ul>
<p>&#x4E00;&#x3064;&#x76EE;&#x306F;&#x3001;&#x30D7;&#x30ED;&#x30D1;&#x30C6;&#x30A3; (props) &#x3068;&#x3057;&#x3066;&#x6DF1;&#x304F;&#x5165;&#x308C;&#x5B50;&#x306B;&#x306A;&#x3063;&#x305F;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x306B;&#x6E21;&#x3059;&#x306E;&#x306F;&#x9762;&#x5012;&#x3067;&#x3001;&#x5144;&#x5F1F;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x3067;&#x306F;&#x5358;&#x7D14;&#x306B;&#x6A5F;&#x80FD;&#x3057;&#x307E;&#x305B;&#x3093;&#x3002;&#x4E8C;&#x3064;&#x76EE;&#x306F;&#x3001;&#x89AA;&#x5B50;&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30BF;&#x30F3;&#x30B9;&#x3092;&#x76F4;&#x63A5;&#x53C2;&#x7167;&#x3057;&#x305F;&#x308A;&#x3001;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x3092;&#x4ECB;&#x3057;&#x3066;&#x8907;&#x6570;&#x306E;&#x72B6;&#x614B;&#x306E;&#x30B3;&#x30D4;&#x30FC;&#x3092;&#x5909;&#x66F4;&#x3001;&#x540C;&#x671F;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x8A66;&#x307F;&#x308B;&#x30BD;&#x30EA;&#x30E5;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x983C;&#x3063;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x304C;&#x3088;&#x304F;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x3089;&#x306E;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x306F;&#x3001;&#x3044;&#x305A;&#x308C;&#x3082;&#x8106;&#x304F;&#x3001;&#x3059;&#x3050;&#x306B;&#x30E1;&#x30F3;&#x30C6;&#x30CA;&#x30F3;&#x30B9;&#x304C;&#x56F0;&#x96E3;&#x306A;&#x30B3;&#x30FC;&#x30C9;&#x306B;&#x7E4B;&#x304C;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<p>&#x3067;&#x306F;&#x3001;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x304B;&#x3089;&#x5171;&#x6709;&#x3057;&#x3066;&#x3044;&#x308B;&#x72B6;&#x614B;&#x3092;&#x62BD;&#x51FA;&#x3057;&#x3001;&#x305D;&#x308C;&#x3092;&#x30B0;&#x30ED;&#x30FC;&#x30D0;&#x30EB;&#x30B7;&#x30F3;&#x30B0;&#x30EB;&#x30C8;&#x30F3;&#x3067;&#x7BA1;&#x7406;&#x3059;&#x308B;&#x306E;&#x306F;&#x3069;&#x3046;&#x3067;&#x3057;&#x3087;&#x3046;&#x304B;&#xFF1F; &#x3053;&#x308C;&#x306B;&#x3088;&#x308A;&#x3001;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x30C4;&#x30EA;&#x30FC;&#x306F;&#x5927;&#x304D;&#x306A; &quot;&#x30D3;&#x30E5;&#x30FC;&quot; &#x3068;&#x306A;&#x308A;&#x3001;&#x3069;&#x306E;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x3082;&#x30C4;&#x30EA;&#x30FC;&#x5185;&#x306E;&#x3069;&#x3053;&#x306B;&#x3042;&#x3063;&#x3066;&#x3082;&#x72B6;&#x614B;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3057;&#x305F;&#x308A;&#x3001;&#x30A2;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x30C8;&#x30EA;&#x30AC;&#x30FC;&#x3067;&#x304D;&#x307E;&#x3059;!</p>
<p>&#x3055;&#x3089;&#x306B;&#x3001;&#x72B6;&#x614B;&#x7BA1;&#x7406;&#x306B;&#x95A2;&#x308F;&#x308B;&#x6982;&#x5FF5;&#x3092;&#x5B9A;&#x7FA9;&#x3001;&#x5206;&#x96E2;&#x3057;&#x3001;&#x7279;&#x5B9A;&#x306E;&#x30EB;&#x30FC;&#x30EB;&#x3092;&#x6577;&#x304F;&#x3053;&#x3068;&#x3067;&#x3001;&#x30B3;&#x30FC;&#x30C9;&#x306E;&#x69CB;&#x9020;&#x3068;&#x4FDD;&#x5B88;&#x6027;&#x3092;&#x5411;&#x4E0A;&#x3055;&#x305B;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p>&#x3053;&#x308C;&#x304C; Vuex &#x306E;&#x80CC;&#x666F;&#x306B;&#x3042;&#x308B;&#x57FA;&#x672C;&#x7684;&#x306A;&#x30A2;&#x30A4;&#x30C7;&#x30A3;&#x30A2;&#x3067;&#x3042;&#x308A;&#x3001;<a href="https://facebook.github.io/flux/docs/overview.html" target="_blank">Flux</a>&#x3001; <a href="http://redux.js.org/" target="_blank">Redux</a> &#x305D;&#x3057;&#x3066; <a href="https://guide.elm-lang.org/architecture/" target="_blank">The Elm Architecture</a>&#x304B;&#x3089;&#x5F71;&#x97FF;&#x3092;&#x53D7;&#x3051;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
&#x4ED6;&#x306E;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x3068;&#x7570;&#x306A;&#x308B;&#x306E;&#x306F;&#x3001;Vuex &#x306F;&#x52B9;&#x7387;&#x7684;&#x306A;&#x66F4;&#x65B0;&#x306E;&#x305F;&#x3081;&#x306B;&#x3001;Vue.js &#x306E;&#x7C92;&#x5EA6;&#x306E;&#x7D30;&#x304B;&#x3044;&#x30EA;&#x30A2;&#x30AF;&#x30C6;&#x30A3;&#x30D3;&#x30C6;&#x30A3;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x5229;&#x7528;&#x3059;&#x308B;&#x3088;&#x3046;&#x7279;&#x5225;&#x306B;&#x8ABF;&#x6574;&#x3057;&#x3066;&#x5B9F;&#x88C5;&#x3055;&#x308C;&#x305F;&#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x3060;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3067;&#x3059;&#x3002;</p>
<p><img src="images/vuex.png" alt="vuex"></p>
<h3 id="&#x3044;&#x3064;&#x3001;vuex&#x3092;&#x4F7F;&#x3046;&#x3079;&#x304D;&#x3067;&#x3057;&#x3087;&#x3046;&#x304B;&#xFF1F;">&#x3044;&#x3064;&#x3001;Vuex&#x3092;&#x4F7F;&#x3046;&#x3079;&#x304D;&#x3067;&#x3057;&#x3087;&#x3046;&#x304B;&#xFF1F;</h3>
<p>Vuex &#x306F;&#x3001;&#x5171;&#x6709;&#x72B6;&#x614B;&#x306E;&#x7BA1;&#x7406;&#x306B;&#x5F79;&#x7ACB;&#x3061;&#x307E;&#x3059;&#x304C;&#x3001;&#x3055;&#x3089;&#x306B;&#x6982;&#x5FF5;&#x3084;&#x30DC;&#x30A4;&#x30E9;&#x30FC;&#x30D7;&#x30EC;&#x30FC;&#x30C8;&#x306E;&#x30B3;&#x30B9;&#x30C8;&#x304C;&#x304B;&#x304B;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F;&#x3001;&#x77ED;&#x671F;&#x7684;&#x751F;&#x7523;&#x6027;&#x3068;&#x9577;&#x671F;&#x7684;&#x751F;&#x7523;&#x6027;&#x306E;&#x30C8;&#x30EC;&#x30FC;&#x30C9;&#x30AA;&#x30D5;&#x3067;&#x3059;&#x3002;</p>
<p>&#x3082;&#x3057;&#x3001;&#x3042;&#x306A;&#x305F;&#x304C;&#x5927;&#x898F;&#x6A21;&#x306A; SPA &#x3092;&#x69CB;&#x7BC9;&#x3059;&#x308B;&#x3053;&#x3068;&#x306A;&#x304F;&#x3001;Vuex &#x3092;&#x5C0E;&#x5165;&#x3057;&#x305F;&#x5834;&#x5408;&#x3001;&#x5197;&#x9577;&#x3067;&#x6050;&#x308D;&#x3057;&#x3044;&#x3068;&#x611F;&#x3058;&#x308B;&#x304B;&#x3082;&#x3057;&#x308C;&#x307E;&#x305B;&#x3093;&#x3002;&#x305D;&#x3046;&#x611F;&#x3058;&#x308B;&#x3053;&#x3068;&#x306F;&#x5168;&#x304F;&#x666E;&#x901A;&#x3067;&#x3059;&#x3002;&#x3042;&#x306A;&#x305F;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x304C;&#x30B7;&#x30F3;&#x30D7;&#x30EB;&#x3067;&#x3042;&#x308C;&#x3070;&#x3001;Vuex &#x306A;&#x3057;&#x3067;&#x554F;&#x984C;&#x306A;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;&#x5358;&#x7D14;&#x306A; <a href="http://jp.vuejs.org/v2/guide/components.html#%E8%A6%AA%E5%AD%90%E9%96%93%E4%BB%A5%E5%A4%96%E3%81%AE%E9%80%9A%E4%BF%A1" target="_blank">&#x30B0;&#x30ED;&#x30FC;&#x30D0;&#x30EB;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x30D0;&#x30B9;</a> &#x304C;&#x5FC5;&#x8981;&#x306A;&#x3060;&#x3051;&#x304B;&#x3082;&#x3057;&#x308C;&#x307E;&#x305B;&#x3093;&#x3002;&#x3057;&#x304B;&#x3057;&#x3001;&#x4E2D;&#x898F;&#x6A21;&#x304B;&#x3089;&#x5927;&#x898F;&#x6A21;&#x306E; SPA &#x3092;&#x69CB;&#x7BC9;&#x3059;&#x308B;&#x5834;&#x5408;&#x306F;&#x3001;Vue &#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x306E;&#x5916;&#x306E;&#x72B6;&#x614B;&#x3092;&#x3069;&#x3046;&#x3084;&#x3063;&#x3066;&#x3046;&#x307E;&#x304F;&#x6271;&#x3046;&#x304B;&#x8003;&#x3048;&#x308B;&#x7D76;&#x597D;&#x306E;&#x6A5F;&#x4F1A;&#x3067;&#x3059;&#x3002;Vuex &#x306F;&#x81EA;&#x7136;&#x306A;&#x6B21;&#x306E;&#x30B9;&#x30C6;&#x30C3;&#x30D7;&#x3068;&#x306A;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;&#x3053;&#x308C;&#x306F; Redux &#x306E;&#x4F5C;&#x8005;&#x3001;Dan Abramov &#x304B;&#x3089;&#x306E;&#x826F;&#x3044;&#x5F15;&#x7528;&#x3067;&#x3059;:</p>
<blockquote>
<p>Flux &#x30E9;&#x30A4;&#x30D6;&#x30E9;&#x30EA;&#x306F;&#x773C;&#x93E1;&#x306E;&#x3088;&#x3046;&#x306A;&#x3082;&#x306E;&#x3067;&#x3059;: &#x305D;&#x308C;&#x3089;&#x304C;&#x5FC5;&#x8981;&#x306B;&#x306A;&#x3063;&#x305F;&#x3068;&#x304D;&#x306B;&#x77E5;&#x308B;&#x306E;&#x3067;&#x3059;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
  <script src="//m.servedby-buysellads.com/monetization.js" type="text/javascript"></script>
  <div class="bsa-cpc"></div>
  <script>
    (function(){
      if(typeof _bsa !== 'undefined' && _bsa) {
      _bsa.init('default', 'CKYD62QM', 'placement:vuejsorg', {
        target: '.bsa-cpc',
        align: 'horizontal',
        disable_css: 'true'
      });
        }
    })();
  </script>

            </div>

            
                
                <a href="installation.html" class="navigation navigation-prev " aria-label="Previous page: インストール">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="getting-started.html" class="navigation navigation-next " aria-label="Next page: Vuex 入門">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Vuex とは何か?","level":"1.4","depth":1,"next":{"title":"Vuex 入門","level":"1.5","depth":1,"path":"getting-started.md","ref":"getting-started.md","articles":[]},"previous":{"title":"インストール","level":"1.3","depth":1,"path":"installation.md","ref":"installation.md","articles":[]},"dir":"ltr"},"config":{"plugins":["edit-link","prism","-highlight","github","-highlight","github"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"edit-link":{"label":"Edit This Page","base":"https://github.com/vuejs/vuex/tree/dev/docs"},"github":{"url":"https://github.com/vuejs/vuex/"},"prism":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":false,"twitter":false,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-vuejs":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Vuex","language":"ja","links":{"sharing":{"facebook":false,"twitter":false}},"gitbook":"2.x.x"},"file":{"path":"intro.md","mtime":"2018-04-20T00:44:03.866Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2018-04-20T00:47:55.633Z"},"basePath":".","book":{"language":"ja"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    

    </body>
</html>

